app/controllers/api/v1/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ? AND "notifications"."read" = 'f'  [["user_id", 1]]
UPDATE "notifications" SET "read" = 't' WHERE "notifications"."user_id" = ? AND "notifications"."read" = 'f'  [["user_id", 1]]
---
  def mark_all_read
    notifications = Notification.where(user_id: current_user.id, read: false)

    notifications.update_all(read: true)