app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "article"], ["text", "article text"], ["user_id", 1], ["created_at", "2015-01-26 19:05:26.291177"], ["updated_at", "2015-01-26 19:05:26.291177"]]