app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Commenter's Name"], ["body", "Their comment"], ["article_id", 2], ["created_at", "2015-01-14 14:52:02.852862"], ["updated_at", "2015-01-14 14:52:02.852862"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def create
    @comment.article_id = params[:article_id]
    @comment.user_id = current_user.id
    if @comment.save

      article = Article.find(@article)
      user = User.find(article.user_id)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 29]]
---
  def destroy
    @notification = Notification.where(:comment_id == @comment.id)
    if @notification.nil?
      @notification.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
---
  def load_article
    @article = Article.find(params[:article_id])