app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 2], ["id", 2]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])