app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ?  [["user_id", 1]]
---
  def index
    @notifications = current_user.notifications
    @notifications.each do |notification|